package com.ktdsuniversity.edu.oop;

public class ArrayTest {

	public static void main(String[] args) {
		/*
		1. 정수형 배열 변수를 만들고 값을 할당해 보세요.

		2. 정수형 배열 변수의 합을 계산해 출력해보세요.

		3. 실수형 배열 변수를 만들고 랜덤한 값을 할당해보세요.

		4. 실수형 배열 변수의 합을 계산해 출력해보세요.

		5. 실수형 배열 변수 내의 가장 큰 값을 출력해보세요 .

		6. 실수형 배열 변수 내의 가장 작은 값을 출력해보세요.

		7. 문자열형 배열 변수를 만들어 값을 할당해 보세요.

		8. 문자열형 배열 변수 내의 값 중 길이가 가장 긴 문자열을 출력해보세요.

		9. 정수형 배열 변수를 만들고 랜덤한 값을 할당해보세요.

		10. 정수형 배열 변수 내의 값 중 평균 이상의 값들만 출력해보세요.

		11. 상품을 표현하는 클래스를 만들어보세요.

		12. 상품을 표현하는 클래스의 배열 변수를 만들어보세요.

		13. 상품을 표현하는 클래스의 배열 변수에서 가장 비싼 상품의 이름을 출력해보세요.

		14. 상품을 표현하는 클래스의 배열 변수내의 모든 상품의 이름을 출력해보세요.

		15. 숫자 형태의 문자열 배열 변수를 만들어보세요.

		16. 숫자 형태의 문자열 배열 변수의 값을 정수로 변환한 뒤 정수의 합과 평균을 출력해보세요.

		17. 불린 형태의 배열 변수를 만들고 값을 랜덤하게 할당해보세요.

		18. 불린 형태의 배열 변수 내에서 true의 개수는 몇 개인지 세어 출력해보세요.

		19. 불린 형태의 배열 변수 내에서 false가 존재하는 비율은 몇 %인지 계산해 출력해보세요.

		20. 문자열 형태의 배열 변수를 만들고 값을 랜덤하게 할당해보세요.

		21. 문자열 형태의 배열 변수 내의 모든 문자열의 길이를 합한 값을 계산해 출력해보세요.
		*/
	}
}
